{
  "acceptRepaymentPlan": "Applicant accepts the defendant's repayment plan (for LiP 1v1 the case must remain online).",
  "agreePartAdmitSettle": "Claimant confirms the part-admission offer settles the dispute.",
  "agreedToMediation": "Claimant opted into free mediation.",
  "allAgreedToLrMediationSpec": "In a SPEC small claim all represented parties have agreed to legal representative mediation (and no party has opted out).",
  "allResponsesReceived": "Every required defendant response has been received",
  "applicantOutOfTimeNotBeingTakenOffline": "Claimant response deadline has passed with no response and staff have not taken the case offline.",
  "applicantOutOfTimeProcessedByCamunda": "Automation has already processed the out-of-time applicant response.",
  "awaitingResponsesFullAdmitReceived": "In a 1v2 two-solicitor case only one defendant has responded with a full admission and the second is outstanding.",
  "awaitingResponsesFullAdmitReceivedSpec": "SPEC analogue: only one defendant has submitted a full admission and the matching response from the other side is pending.",
  "awaitingResponsesFullDefenceReceived": "In a 1v2 two-solicitor case only one defendant has provided a full defence and the other is yet to respond.",
  "awaitingResponsesFullDefenceReceivedSpec": "SPEC analogue: one defendant has filed a full defence and the paired response is pending.",
  "awaitingResponsesNonFullDefenceOrFullAdmitReceived": "In a 1v2 two-solicitor case a single defendant has responded with something other than full defence/admission while the co-defendant is outstanding.",
  "awaitingResponsesNonFullDefenceOrFullAdmitReceivedSpec": "SPEC analogue: a non full-defence/admission response was received while the paired response is still outstanding.",
  "bothDefSameLegalRep": "Both defendants share the same legal representative.",
  "caseDismissedAfterClaimAcknowledged": "Claim was acknowledged but the response deadline has expired without a response and staff have not intervened.",
  "caseDismissedAfterDetailNotified": "Claim details notification deadline expired with no response or staff action.",
  "caseDismissedAfterDetailNotifiedExtension": "Claim details notification deadline expired while an extension applied and no responses or staff action occurred.",
  "caseDismissedPastHearingFeeDue": "Hearing fee due date has passed without payment.",
  "casemanMarksMediationUnsuccessful": "Mediation service recorded the session as unsuccessful.",
  "ccjRequestJudgmentByAdmission": "Applicant has requested a CCJ by admission.",
  "certificateOfServiceEnabled": "Certificate of Service workflow is enabled for this case.",
  "claimDetailsNotified": "Claim details have been successfully notified.",
  "claimDismissedByCamunda": "Camunda automation has already dismissed the claim.",
  "claimIssued": "Claim has been issued (a notification deadline exists).",
  "claimNotified": "Claim notification has been sent (acknowledgement deadline exists).",
  "contactDetailsChange": "Contact details change event has been triggered on the case.",
  "counterClaim": "Latest defence is a counter claim (unspecified journey).",
  "counterClaimSpec": "Latest defence is a counter claim for SPEC.",
  "declinedMediation": "Claimant has declined free mediation.",
  "demageMultiClaim": "Allocated track is multi-track for an UNSPEC claim.",
  "divergentRespondGoOffline": "Defendant responses diverge so the case must go offline.",
  "divergentRespondGoOfflineSpec": "SPEC defendant/claimant responses diverge so the case must go offline.",
  "divergentRespondWithDQAndGoOffline": "Responses diverge and discrete directions questionnaires must be produced before going offline.",
  "divergentRespondWithDQAndGoOfflineSpec": "SPEC divergent responses requiring DQs before going offline.",
  "fullAdmission": "Latest defence is a full admission (unspecified).",
  "fullAdmissionSpec": "Latest defence is a full admission in SPEC.",
  "fullAdmitPayImmediately": "SPEC 1v1 full admission where the defendant proposes to pay immediately and claimant has not decided whether to proceed.",
  "fullDefence": "Latest defence is a full defence (unspecified).",
  "fullDefenceNotProceed": "Claimant indicates they do not wish to proceed against the defendant(s).",
  "fullDefenceProceed": "Claimant elects to proceed against the defendant(s).",
  "fullDefenceSpec": "Latest defence is a full defence in SPEC.",
  "isCarmApplicableCase": "Case meets CARM pilot criteria for represented parties in SPEC small claims.",
  "isCarmApplicableLipCase": "Case meets CARM pilot criteria for LiP participation in SPEC small claims.",
  "isClaimantNotSettleFullDefenceClaim": "Claimant indicates they will not settle after a full defence.",
  "isClaimantNotSettlePartAdmitClaim": "Claimant indicates they will not settle after a part admission.",
  "isClaimantSettleTheClaim": "Claimant indicates the claim has been settled.",
  "isDefendantNoCOnlineForCase": "Defendant Notice of Change online feature flag is active for this case.",
  "isDefendantNoCOnlineForCaseAfterJBA": "Case is LiP with an active judgment by admission and a post-judgment Notice of Change has occurred.",
  "isDefendantNotPaidFullDefenceClaim": "Claimant states the defendant has not paid the amount ordered on a full defence outcome.",
  "isInHearingReadiness": "Hearing has been listed and the case is in hearing readiness (no dismissals/taken offline).",
  "isLiPvLRCase": "Case is LiP v represented (one party self-represented and the other legally represented) in a 1v1.",
  "isLipCase": "Case is LiP v LiP in a 1v1 scenario.",
  "isLipvLROneVOne": "Case is LiP v represented (1v1).",
  "isPayImmediately": "Defendant has proposed to pay the admitted amount immediately.",
  "isRespondentSignSettlementAgreement": "Defendant has signed the digital settlement agreement.",
  "isTranslatedDocumentUploaded": "Translated response documents have been uploaded.",
  "lipFullDefenceProceed": "LiP claimant has opted to proceed following a full defence response.",
  "nocSubmittedForLiPApplicant": "Notice of Change submitted for a LiP claimant.",
  "nocSubmittedForLiPDefendant": "Notice of Change submitted for a LiP defendant.",
  "nocSubmittedForLiPDefendantBeforeOffline": "LiP defendant submitted a Notice of Change before the case went offline.",
  "notificationAcknowledged": "At least one defendant has acknowledged service (per scenario rules).",
  "oneVsOneCase": "Case is a single claimant v single defendant matter.",
  "onlyInitialRespondentResponseLangIsBilingual": "Respondent marked their response as bilingual but has not requested ongoing bilingual processing.",
  "partAdmission": "Latest defence is a part admission (unspecified).",
  "partAdmissionSpec": "Latest defence is a part admission in SPEC.",
  "partAdmitPayImmediately": "Defendant offered to pay the part-admitted amount immediately and claimant accepted.",
  "pastClaimDetailsNotificationDeadline": "Claim details notification deadline has expired.",
  "pastClaimNotificationDeadline": "Claim notification deadline has expired.",
  "paymentFailed": "Card payment failed for the claim issue fee.",
  "paymentSuccessful": "Card payment succeeded for the claim issue fee.",
  "pendingClaimIssued": "Case ready to move from payment success to pending issue (represented defendants with registered orgs).",
  "pendingClaimIssuedUnrepresentedDefendentPredicate": "At least one defendant is unrepresented (with scenario-specific rules) so the LiP pending issue state applies.",
  "pinInPostEnabledAndLiP": "PIN-in-Post feature is enabled and the defendant is a LiP.",
  "reasonNotSuitableForSdo": "Claimant flagged that the case is not suitable for an SDO.",
  "rejectRepaymentPlan": "Applicant rejected the defendant’s repayment plan (and case remains online for LiP 1v1).",
  "respondent1NotRepresented": "First defendant is unrepresented.",
  "respondent1OrgNotRegistered": "First defendant is represented but their organisation is not registered.",
  "respondent2NotRepresented": "Second defendant is unrepresented.",
  "respondent2OrgNotRegistered": "Second defendant is represented but their organisation is not registered.",
  "respondentTimeExtension": "A defendant has obtained a time extension to respond.",
  "specClaim": "Case is in the SPEC (damages) service.",
  "takenOfflineAfterClaimDetailsNotified": "Claim was taken offline because not all defendants were notified of claim details online.",
  "takenOfflineAfterClaimNotified": "Claim was taken offline after notification but before claim details were served.",
  "takenOfflineAfterNotSuitableForSdo": "Claim flagged as not suitable for SDO and taken offline.",
  "takenOfflineAfterSDO": "Claim was taken offline after directions (SDO) were drawn.",
  "takenOfflineByStaff": "HMCTS staff have manually taken the case offline.",
  "takenOfflineByStaffAfterClaimDetailsNotified": "Staff took the case offline after claim details were notified (and before any responses/time extensions).",
  "takenOfflineByStaffAfterClaimDetailsNotifiedExtension": "Staff took the case offline after claim details were notified while an extension was active.",
  "takenOfflineByStaffAfterClaimIssue": "Staff took the case offline between claim submission and issue.",
  "takenOfflineByStaffAfterClaimNotified": "Staff took the case offline after notification but before claim details were served.",
  "takenOfflineByStaffAfterClaimantResponseBeforeSDO": "Staff took the case offline after claimant response but before an SDO was drawn.",
  "takenOfflineByStaffAfterDefendantResponse": "Staff took the case offline after a defendant response and before claimant action.",
  "takenOfflineByStaffAfterNotificationAcknowledged": "Staff took the case offline after service acknowledgement and before defence/extension.",
  "takenOfflineByStaffAfterSDO": "Staff took the case offline after an SDO was drawn.",
  "takenOfflineByStaffBeforeClaimIssued": "Staff took the case offline before the claim was issued.",
  "takenOfflineByStaffBeforeMediationUnsuccessful": "Staff took the case offline before mediation recorded an outcome.",
  "takenOfflineBySystem": "System automatically took the case offline (for example because of representation changes).",
  "takenOfflineSDONotDrawn": "Case was taken offline because it was marked not suitable for an SDO.",
  "takenOfflineSDONotDrawnAfterClaimDetailsNotified": "Case marked not suitable for SDO and taken offline after claim details notification.",
  "takenOfflineSDONotDrawnAfterClaimDetailsNotifiedExtension": "Case marked not suitable for SDO and taken offline during a claim-details extension.",
  "takenOfflineSDONotDrawnAfterNotificationAcknowledged": "Case marked not suitable for SDO and taken offline after service acknowledgement.",
  "caseDismissedAfterClaimAcknowledgedExtension": "Claim was acknowledged, an extension applied, and the dismissal deadline passed without response or staff action.",
  "takenOfflineByStaffAfterNotificationAcknowledgedTimeExtension": "Staff took the case offline after acknowledgement while a time extension was in play.",
  "takenOfflineSDONotDrawnAfterNotificationAcknowledgedTimeExtension": "Case marked not suitable for SDO and taken offline after acknowledgement while an extension applied.",
  "claimSubmittedOneRespondentRepresentative": "Single defendant representative covers all parties.",
  "claimSubmitted1v1RespondentOneUnregistered": "1v1 claim where the respondent representative is not registered.",
  "claimSubmittedTwoRegisteredRespondentRepresentatives": "Two defendants, both represented by registered organisations.",
  "claimSubmittedTwoRespondentRepresentativesOneUnregistered": "Two defendants with separate representatives, one organisation unregistered.",
  "claimSubmittedBothUnregisteredSolicitors": "Both defendant solicitors are unregistered organisations.",
  "claimSubmittedOneUnrepresentedDefendantOnly": "Only defendant is unrepresented.",
  "claimSubmittedRespondent1Unrepresented": "Defendant 1 is unrepresented.",
  "claimSubmittedRespondent2Unrepresented": "Defendant 2 is unrepresented."
}
