{
  "Bundle creation scheduler": {
    "purpose": "Builds bundles for eligible hearings each evening."
  },
  "Case dismissed scheduler": {
    "purpose": "Automatically dismisses claims that have missed their deadlines."
  },
  "Decision outcome scheduler": {
    "purpose": "Moves cases awaiting judicial decisions into the decision outcome workflow."
  },
  "Defendant response deadline check scheduler": {
    "purpose": "Sweeps for defendants whose response deadline elapsed and triggers enforcement."
  },
  "Evidence upload scheduler": {
    "purpose": "Prompts parties to upload evidence when deadlines are approaching."
  },
  "Full admit pay immediately no payment scheduler": {
    "purpose": "Escalates full-admit cases where an immediate payment was promised but not received."
  },
  "Proof of debt scheduler": {
    "purpose": "Generates proof-of-debt artefacts for COSC-linked general applications."
  },
  "GA doc upload notify scheduler": {
    "purpose": "Sends notifications when GA supporting documents are uploaded."
  },
  "GA order made scheduler": {
    "purpose": "Publishes GA order-made events to downstream services each afternoon."
  },
  "GA response deadline processor": {
    "purpose": "Processes GA response deadlines, judge revisits and respondent checks."
  },
  "GA unless order scheduler": {
    "purpose": "Enforces GA Unless Orders once the compliance deadline passes."
  },
  "Hearing cvp link scheduler": {
    "purpose": "Issues CVP/remote hearing links on a daily cadence."
  },
  "Hearing fee check scheduler": {
    "purpose": "Checks for unpaid hearing fees and raises the necessary follow-up tasks."
  },
  "Generate CSV and send to MMT scheduler": {
    "purpose": "Produces nightly CSV/JSON exports for the mediation service (MMT)."
  },
  "Manage Stay WA Task Scheduler": {
    "purpose": "Maintains WA tasks for stayed cases so that no follow-up is missed."
  },
  "Migrate cases scheduler": {
    "purpose": "Reserved cron to re-run large case migration batches."
  },
  "Notify claim deadline scheduler": {
    "purpose": "Notifies parties about upcoming claim deadlines, prior to dismissal."
  },
  "Incident retry scheduler": {
    "purpose": "Retries failed external incident tasks each night."
  },
  "Order Review Obligation check scheduler": {
    "purpose": "Checks order review obligations and triggers outstanding actions."
  },
  "Polling event emitter scheduler": {
    "purpose": "Emits polling events across the day so downstream pollers stay in sync."
  },
  "Request for reconsideration notification check scheduler": {
    "purpose": "Ensures reconsideration notifications are sent when conditions are met."
  },
  "Retrigger cases scheduler": {
    "purpose": "One-off cron to retrigger case updates as part of the 2026 migration plan."
  },
  "Update General application Case management Location": {
    "purpose": "Future-dated cron to re-sync GA case management locations."
  },
  "Update location": {
    "purpose": "Future-dated cron to re-sync the main case location."
  },
  "Settlement no response from defendant scheduler": {
    "purpose": "Moves settlement agreements forward when the defendant failed to respond."
  },
  "Spec automated hearing notice scheduler": {
    "purpose": "Builds automated hearing notices for Spec claims twice per day."
  },
  "Take case offline scheduler": {
    "purpose": "Transitions cases that must move off digital rails."
  },
  "Trial ready check scheduler": {
    "purpose": "Verifies trial readiness status for outstanding cases."
  },
  "Trial ready notification scheduler": {
    "purpose": "Sends notifications when trial readiness has been confirmed."
  },
  "Unspec automated hearing notice scheduler": {
    "purpose": "Builds automated hearing notices for Unspec claims twice per day."
  }
}
